app/controllers/tasks_controller.rb

  def create
    @task = Task.new(task_params)
		if @task.save
---
INSERT INTO `tasks` (`created_at`, `updated_at`, `title`, `description`) VALUES ('2017-01-18 18:17:09', '2017-01-18 18:17:09', 't1', '')

  def destroy
    @task = Task.find(params[:id])
        @task.destroy
---
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 5 LIMIT 1
DELETE FROM `tasks` WHERE `tasks`.`id` = 5

  def show
    @task = Task.find(params[:id])
---
SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 2 LIMIT 1